{
  "OpenAI API Key Required": "ต้องการ OpenAI API Key",
  "Please set your OpenAI API key in the bottom left of the sidebar.": "กรุณาตั้งค่า OpenAI API Key ที่มุมล่างซ้ายของแถบด้านข้าง",
  "Stop Generating": "หยุดการสร้าง",
  "Prompt limit is {{maxLength}} characters": "ขีดจำกัดข้อความคือ {{maxLength}} ตัวอักษร",
  "System Prompt": "ข้อความพร้อมต์ของระบบ",
  "You are ChatGPT, a large language model trained by OpenAI. Follow the user's instructions carefully. Respond using markdown.": "คุณคือ ChatGPT โมเดลภาษาขนาดใหญ่ที่ฝึกโดย OpenAI กรุณาทำตามคำสั่งของผู้ใช้อย่างระมัดระวัง ตอบโดยใช้ markdown",
  "Enter a prompt": "ป้อนข้อความพร้อมต์",
  "Regenerate response": "สร้างคำตอบใหม่",
  "Sorry, there was an error.": "ขออภัย เกิดข้อผิดพลาด",
  "Model": "โมเดล",
  "Select a model": "เลือกโมเดล",
  "View Account Usage": "ดูการใช้งานบัญชี",
  "Conversation": "บทสนทนา",
  "OR": "หรือ",
  "Loading...": "กำลังโหลด...",
  "Type a message...": "พิมพ์ข้อความ...",
  "Type a message or type \"/\" to select a prompt...": "พิมพ์ข้อความหรือพิมพ์ \"/\" เพื่อเลือกพร้อมต์...",
  "Error fetching models.": "เกิดข้อผิดพลาดในการดึงข้อมูลโมเดล",
  "AI": "AI",
  "You": "คุณ",
  "Cancel": "ยกเลิก",
  "Save & Submit": "บันทึกและส่ง",
  "Make sure your OpenAI API key is set in the bottom left of the sidebar.": "ตรวจสอบให้แน่ใจว่าได้ตั้งค่า OpenAI API Key ไว้ที่มุมล่างซ้ายของแถบด้านข้าง",
  "If you completed this step, OpenAI may be experiencing issues.": "หากคุณทำขั้นตอนนี้เสร็จแล้ว OpenAI อาจกำลังประสบปัญหา",
  "click if using a .env.local file": "คลิกหากใช้ไฟล์ .env.local",
  "Message limit is {{maxLength}} characters. You have entered {{valueLength}} characters.": "ขีดจำกัดข้อความคือ {{maxLength}} ตัวอักษร คุณได้ป้อน {{valueLength}} ตัวอักษร",
  "Please enter a message": "กรุณาป้อนข้อความ",
  "New Conversation": "บทสนทนาใหม่",
  "Select a plugin": "เลือกปลั๊กอิน",
  "Chatbot UI is an advanced chatbot kit for OpenAI's chat models aiming to mimic ChatGPT's interface and functionality.": "Chatbot UI เป็นชุดเครื่องมือแชทบอทขั้นสูงสำหรับโมเดลแชทของ OpenAI ที่มีเป้าหมายเพื่อเลียนแบบอินเทอร์เฟซและฟังก์ชันการทำงานของ ChatGPT",
  "Are you sure you want to clear all messages?": "คุณแน่ใจหรือไม่ว่าต้องการลบข้อความทั้งหมด?",
  "Enter a prompt or type \"/\" to select a prompt...": "ป้อนข้อความพร้อมต์หรือพิมพ์ \"/\" เพื่อเลือกพร้อมต์...",
  "Higher values like 0.8 will make the output more random, while lower values like 0.2 will make it more focused and deterministic.": "ค่าที่สูงกว่า เช่น 0.8 จะทำให้ผลลัพธ์สุ่มมากขึ้น ขณะที่ค่าที่ต่ำกว่า เช่น 0.2 จะทำให้คำตอบมีความเฉพาะเจาะจงและคงที่มากขึ้น",
  "Precise": "แม่นยำ",
  "Neutral": "สมดุล",
  "Creative": "สร้างสรรค์"
}
